Revit 2026 API

# RebarShapeConstraintSagittaLength Properties

---

The RebarShapeConstraintSagittaLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

#### Reference

RebarShapeConstraintSagittaLength Class

Autodesk.Revit.DB.Structure Namespace